def area(a, b):
    '''
    Вычисляет площадь прямоугольника.

    ---
    
    Параметры:
        a (float): длина первой стороны
        b (float): длина второй стороны
        
    Возвращаемое значение:
        area (float): площадь прямоугольника
        
    Пример вызова:
        area(4, 5)  # возвращает 20
    '''
    return a * b


def perimeter(a, b):
    '''
    Вычисляет периметр прямоугольника.

    ---
    
    Параметры:
        a (float): длина первой стороны
        b (float): длина второй стороны
        
    Возвращаемое значение:
        perimeter (float): периметр прямоугольника
        
    Пример вызова:
        perimeter(4, 5)  # возвращает 18
    '''
    return (a + b) * 2